// export enum BankAccountNameEnum {
//   /**
//    * @description บมจ. ธนาคารไทยพาณิชย์
//    */
//   SCB = 'SCB',
//   /**
//    * @description บมจ. ธนาคารกรุงเทพ
//    */
//   BBL = 'BBL',
//   /**
//    * @description บมจ. ธนาคารกสิกรไทย
//    */
//   KBANK = 'KBANK',
//   /**
//    * @description บมจ. ธนาคารยูโอบี
//    */
//   UOB = 'UOB',
//   /**
//    * @description บมจ. ธนาคารกรุงศรีอยธุยา
//    */
//   BAY = 'BAY',
//   /**
//    * @description บมจ. ธนาคารกรุงไทย
//    */
//   KTB = 'KTB',
//   /**
//    * @description บมจ. ธนาคารทหารไทย
//    */
//   TMB = 'TMB',
//   /**
//    * @description บมจ. ธนาคารธนชาติ
//    */
//   TBANK = 'TBANK',
//   /**
//    * @description บมจ. ธนาคารซีไอเอ็มบีไทย
//    */
//   CIMB = 'CIMB',
//   /**
//    * @description บมจ. ธนาคารแลนด์แอนด์เฮ้าส์จำกัด
//    */
//   LH = 'LH'
// }

export enum BankAccountStatusEnum {
  PENDING = 'pending',
  APPROVED = 'approved',
  REJECTED = 'rejected'
}

// ANZ || ธนาคาร เอเอ็นแซด (ไทย) จ ากัด (มหาชน)
// OCBC || ธนาคาร โอเวอร์ซี-ไชนีสแบงกิ ้งคอร์ปอเรชั่น จ ากัด
// HSBC || ธนาคาร ฮ่องกงและเซี่ยงไฮ้แบงกิ ้งคอร์ปอเรชั่น จ ากัด
// RHB || ธนาคาร อาร์ เอช บี จ ากัด
// Indian || ธนาคาร อินเดียนโอเวอร์ซีส์ สาขากรุงเทพฯ
// BNPP || ธนาคาร บีเอ็นพี พารีบาส์
// SMBC || ธนาคาร ซูมิโตโม มิตซุย แบงกิ ้ง คอร์ปอเรชั่น
// BOC || ธนาคาร แห่งประเทศจีน จ ากัด
// JPMCB || ธนาคาร เจพีมอร์แกน เชส
// SMBT || ธนาคาร ซูมิโตโม มิตซุย ทรัสต์ (ไทย) จ ากัด (มหาชน)
// BofA || ธนาคาร แห่งอเมริกาเนชั่นแนลแอสโซซิเอชั่น
// CITI || ธนาคาร ซิตี ้แบงก์ เอ็น.เอ.
// DBBK || ธนาคาร ดอยซ์แบงก์
// Mega || ธนาคาร เมกะ สากลพาณิชย์ จ ากัด (มหาชน)
// MIZUHO || ธนาคาร มิซูโฮ จ ากัด สาขากรุงเทพฯ
